# 188.308 Informationsvisualisierung (UE 1,0) 2024W
## Assignement 1

In [1]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv("artisdata.csv", delimiter=";")
data.head()

,a.id,a.firstname,a.lastname,a.gender,a.birthdate,a.deathdate,a.birthplace,a.deathplace,a.nationality,e.id,e.title,e.venue,e.startdate,e.type,e.paintings,e.country,e.city,e.latitude,e.longitude
0,1,William Bernard,Adeney,M,1878-01-01,1966-01-01,London,London,GB,489,"Second Post-Impressionist Exhibition. British,...",Grafton Galleries,1912,group,4,GB,London,51.514248,-0.093145
1,1,William Bernard,Adeney,M,1878-01-01,1966-01-01,London,London,GB,618,Exhibition of the Camden Town Group and Others,Public Art Galleries,1913,group,6,GB,Brighton,50.833333,-0.15
2,1,William Bernard,Adeney,M,1878-01-01,1966-01-01,London,London,GB,720,The Second Exhibition of Works by Members of t...,Goupil Gallery,1915,group,4,GB,London,51.514248,-0.093145
3,1,William Bernard,Adeney,M,1878-01-01,1966-01-01,London,London,GB,729,Third Exhibition of Works by Members of the Lo...,Goupil Gallery,1915,group,5,GB,London,51.514248,-0.093145
4,1,William Bernard,Adeney,M,1878-01-01,1966-01-01,London,London,GB,650,The First Exhibition of Works by Members of Th...,Goupil Gallery,1914,group,5,GB,London,51.514248,-0.093145

In [3]:
data['a.birthdate'] = data['a.birthdate'].astype(str).str[:4]
data['a.deathdate'] = data['a.deathdate'].astype(str).str[:4]
data.head()

,a.id,a.firstname,a.lastname,a.gender,a.birthdate,a.deathdate,a.birthplace,a.deathplace,a.nationality,e.id,e.title,e.venue,e.startdate,e.type,e.paintings,e.country,e.city,e.latitude,e.longitude
0,1,William Bernard,Adeney,M,1878,1966,London,London,GB,489,"Second Post-Impressionist Exhibition. British,...",Grafton Galleries,1912,group,4,GB,London,51.514248,-0.093145
1,1,William Bernard,Adeney,M,1878,1966,London,London,GB,618,Exhibition of the Camden Town Group and Others,Public Art Galleries,1913,group,6,GB,Brighton,50.833333,-0.15
2,1,William Bernard,Adeney,M,1878,1966,London,London,GB,720,The Second Exhibition of Works by Members of t...,Goupil Gallery,1915,group,4,GB,London,51.514248,-0.093145
3,1,William Bernard,Adeney,M,1878,1966,London,London,GB,729,Third Exhibition of Works by Members of the Lo...,Goupil Gallery,1915,group,5,GB,London,51.514248,-0.093145
4,1,William Bernard,Adeney,M,1878,1966,London,London,GB,650,The First Exhibition of Works by Members of Th...,Goupil Gallery,1914,group,5,GB,London,51.514248,-0.093145

In [4]:
missing_values = data.isna().sum()
missing_values

a.id             0
a.firstname      0
a.lastname       0
a.gender         0
a.birthdate      0
a.deathdate      0
a.birthplace     0
a.deathplace     0
a.nationality    0
e.id             0
e.title          0
e.venue          0
e.startdate      0
e.type           0
e.paintings      0
e.country        0
e.city           0
e.latitude       0
e.longitude      0
dtype: int64

- Select a time interval instead of the full range
- Aggregate by calendar interval, e.g., by year
- Select a smaller region in space instead of the whole extent, e.g., exhibitions in certain countries
- Aggregate by spatial hierarchy, e.g., cities, countries, or continents
- Select a subset of the data, e.g., artists with certain nationalities, male/female artists, certain film types
- Aggregate by such data subsets, e.g., exhibition locations over time for female/male artists

What needs to be included:
 
- the temporal component needs to be considered in any case
- you can simplify and aggregate spatial dimension
- you can look at single or groups of data cases (artists, exhibitions, films)

In [5]:
unique_values = data['e.country'].unique()
unique_values

array(['GB', 'NL', 'DE', 'RU', 'UA', 'CH', 'HU', 'AT', 'US', 'LV', 'FR',
       'JP', 'BE', 'CZ', 'IT', 'LT', 'ES', 'SE', 'PL', 'NO', '\\N'],
      dtype=object)

In [6]:
value_counts = data['e.country'].value_counts()
value_counts

e.country
DE    20529
GB     8697
IT     7031
NL     6691
FR     6358
AT     4771
HU     4096
BE     3615
RU     2887
US     2687
CZ     2279
UA      923
CH      507
SE      492
LV      414
PL       40
JP       26
LT       17
ES        8
\N        6
NO        4
Name: count, dtype: int64

In [7]:
value_counts = data['e.id'].value_counts()
value_counts

e.id
992     3648
174     1374
672      994
109      942
1244     928
        ...
370        1
527        1
402        1
185        1
499        1
Name: count, Length: 1069, dtype: int64

In [8]:
value_counts = data['a.id'].value_counts()
value_counts

a.id
317     114
401     110
416     109
37      108
58      104
       ...
9504      1
9503      1
9500      1
9498      1
9041      1
Name: count, Length: 13267, dtype: int64

In [9]:
value_counts = data['a.nationality'].value_counts()
value_counts

a.nationality
DE    15204
FR     9734
GB     7559
NL     6645
\N     4783
IT     4027
HU     3468
AT     3443
BE     3369
RU     3108
CZ     2235
US     2145
CH     1417
SE      975
PL      881
ES      665
NO      600
DK      476
UA      252
AU      212
IE      174
BG       84
RO       75
CA       56
HR       54
JP       46
FI       43
SK       42
LV       33
GE       30
AM       23
SI       23
AR       21
MX       21
GR       19
NZ       19
LT       15
EE       14
RS       14
PT       10
DO        9
ZA        9
BY        8
TR        7
IL        5
PE        4
CL        4
LU        4
IN        4
VE        3
UY        2
BA        2
GT        1
SV        1
ME        1
Name: count, dtype: int64

In [10]:
value_counts = data[data['a.nationality'] == 'DE']['a.id'].value_counts()
print(value_counts)

a.id
225      101
517       97
65        92
461       78
581       75
        ...
2795       1
11284      1
3263       1
2887       1
2709       1
Name: count, Length: 2006, dtype: int64

In [11]:
value_counts = data[data['a.nationality'] == 'DE']['e.country'].value_counts()
print(value_counts)

e.country
DE    12436
AT      690
IT      594
GB      368
NL      272
US      209
HU      205
CZ      123
FR      122
CH       84
BE       56
RU       21
JP       13
UA        8
LV        3
Name: count, dtype: int64

-> German artists mainly display in Germany

In [12]:
value_counts = data[data['e.country'] == 'AT']['e.city'].value_counts()
print(value_counts)

e.city
Vienna    4771
Name: count, dtype: int64

-> Vienna is the only displaying city in Austria

In [13]:
value_counts = data[data['e.country'] == 'DE']['e.city'].value_counts()
print(value_counts)

e.city
Munich                      8479
Berlin                      6143
Cologne                     1329
Dusseldorf                   963
Bremen                       811
Leipzig                      649
-                            646
Mannheim                     490
Stuttgart                    202
Darmstadt                    193
Dresden                      181
Weimar                       157
Hamburg                       95
Essen                         90
Frankfurt am Main             86
Brandenburg an der Havel       9
Bielefeld                      1
Jena                           1
Chemnitz                       1
Krefeld                        1
Magdeburg                      1
Hagen                          1
Name: count, dtype: int64

In [14]:
value_counts = data[data['e.country'] == 'GB']['e.city'].value_counts()
print(value_counts)

e.city
London       8136
Brighton      245
\N            245
Liverpool      50
Glasgow        21
Name: count, dtype: int64

In [15]:
value_counts = data[data['e.country'] == 'US']['e.city'].value_counts()
print(value_counts)

e.city
Pittsburgh       1472
New York          949
Chicago           183
Boston             59
Cincinnati         21
Dresden             2
San Francisco       1
Name: count, dtype: int64

In [16]:
unique_values = data['e.paintings'].unique()
unique_values

array([  4,   6,   5,   3,   1,  13,  12,   9,   2,  18,   7,  62,  73,
        10,  14,  53,  90,   8,  20,  19,  24,  11,  40,  25,  36,  84,
        26, 114,  23,  17,  28,  81,  15,  47,  56,  16,  33,  50,  42,
        48,  29,  22,  55,  41,  30,  34,  21,  60,  27,  59, 262,  69,
        68,  79,  61, 227,  38,  32,  85,  71,  65,  37,  35,  39,  44,
        49,  52,  57,  54, 150, 257, 760,  64, 112,  58,  72,  46, 124,
        66,  45,  31,  83, 127,  97,  74,  91,  75, 136, 151,  67,  76,
        43,  92, 110, 192, 282, 222, 129, 108, 219,  95,  80, 178, 200,
       431, 100, 125,  98,  51,  70, 193, 132, 145, 120, 174, 239,  82,
       376, 385, 121, 101, 142, 203, 166,  96,  89, 146, 165, 148,  63,
       111,  99, 141, 214, 184, 302, 134, 252,  86, 152, 123, 226,  87,
       119, 201, 477, 126, 215, 149, 128, 144, 143,  77, 109, 104, 210,
        94,  88])

My Idea: Display on a map of Germany all cities who host exhibitions. User can zoom to cities and can view top 5 displayed artists and countries they're from